using System;
using GTA;
using GTA.Native;
using GTA.Math;
using GTA.UI;
using static GTA.Script;
using Screen = GTA.UI.Screen;
using System.Windows.Forms;
using System.Drawing;
using System.Collections.Specialized;
using System.Security.Permissions;
using System.Collections.Generic;
using System.Linq;
using System.Threading;
using System.Threading.Tasks;
using System.Runtime.InteropServices;
using System.ComponentModel;
using System.ComponentModel.Design;
using System.Runtime.CompilerServices;
using System.Net.Mime;
using Main = CruelMastersOnlineOffline.CruelMastersOnlineOffline;
using static System.Runtime.InteropServices.Marshal;
using System.Text;
using System.Collections.ObjectModel;
using System.Diagnostics;
using System.Media;
using LemonUI.Menus;
using LemonUI.Scaleform;
using LemonUI;
using System.Xml;
using System.Xml.Linq;
using System.IO;
using System.Drawing.Imaging;
using System.Xml.Serialization;
using LemonUI.Elements;
using System.Net.Http.Headers;
using System.CodeDom;
using System.Runtime.Remoting.Channels;

namespace CruelMastersOnlineOffline
{
    public class CruelMastersOnlineOffline : Script
    {
        #region Important Variables (Debug Stuff)
        public static ScriptSettings Config;
        //bool dlcInstalled = Function.Call<bool>(Hash.IS_​DLC_​PRESENT, Game.GenerateHash("mphcctb"));
        public static bool DEBUG = true;
        public static int TeleTimer;
        public static int TeleSwitch;
        public static int lastHelpTime = 0;

            #endregion
            #region Peds
            if (shopowners.Count > 0)
            {
                foreach (Ped p in shopowners.ToList())
                {
                    if (p != null)
                    {
                        p.Delete();
                        shopowners.Remove(p);
                    }
                }
            }
            #endregion
            #region Props
            #endregion
            #region Blips
            #endregion
            #region Cameras
            #endregion
            #region Pickups
            #endregion
        }

        public static void SET_WEAPON_OWNERSHIP()
        {
            OwnedWeapons CurrentOwned = new OwnedWeapons()
            {
                Weapon = new(),
                Components = new(),
                CompTint = new(),
                Tint = new(),
            };

            foreach (WeaponHash weapon in (typeof(WeaponHash)).GetEnumValues())
            {
                if (Game.Player.Character.Weapons.HasWeapon(weapon))
                {
                    if (!CurrentOwned.Weapon.Contains(weapon))
                    {
                        CurrentOwned.Weapon.Add(weapon);
                    }
                    foreach (WeaponComponentHash weaponcomp in (typeof(WeaponComponentHash)).GetEnumValues())
                    {
                        if (Game.Player.Character.Weapons[weapon].Components[weaponcomp].Active)
                        {
                            if (!CurrentOwned.Components.Contains(weaponcomp))
                            {
                                CurrentOwned.Components.Add(weaponcomp);
                            }
                            if (weaponcomp.ToString().Contains("Camo"))
                            {
                                for (int i = 0; i < 32; i++)
                                {
                                    if (!CurrentOwned.CompTint.Contains(i))
                                    {
                                        CurrentOwned.CompTint.Add(i);
                                    }
                                }
                            }
                        }
                    }

                    for (int i = 0; i < Function.Call<int>(Hash.GET_WEAPON_TINT_COUNT, weapon); i++)
                    {
                        if (!CurrentOwned.Tint.Contains(i))
                        {
                            CurrentOwned.Tint.Add(i);
                        }
                    }
                    OwnedWeapons.OwnedWeapon.Add(CurrentOwned);
                }
            }
            XMLSerializer.SaveToXML<OwnedWeapons>(OwnedWeapons.OwnedWeapon[0], "scripts\\CruelMastersOnlineOfflineAssets\\OwnedWeaponary.xml");
        }

        [StructLayout(LayoutKind.Explicit, Size = 0x138)]
        public unsafe struct DlcWeaponData
        {
            [FieldOffset(0x00)] public int validCheck; //use DLC1::IS_CONTENT_ITEM_LOCKED on this
            [FieldOffset(0x08)] public int weaponHash;
            [FieldOffset(0x18)] public int weaponCost;
            [FieldOffset(0x20)] public int ammoCost;
            [FieldOffset(0x28)] public int ammoType;
            [FieldOffset(0x30)] public int defaultClipSize;
            [FieldOffset(0x38)] public fixed byte nameLabel[0x40];
            [FieldOffset(0x78)] public fixed byte descLabel[0x40];
            [FieldOffset(0xB8)] public fixed byte desc2Label[0x40]; // usually "the" + name
            [FieldOffset(0xF8)] public fixed byte upperCaseNameLabel[0x40];

            public bool IsValid => !Function.Call<bool>(GTA.Native.Hash.IS_CONTENT_ITEM_LOCKED, validCheck);

            public WeaponHash Hash => (WeaponHash)weaponHash;

            public string DisplayName
            {
                get
                {
                    fixed (byte* ptr = nameLabel)
                    {
                        return PtrToStringUTF8(new IntPtr(ptr));
                    }
                }
            }

            public string DescriptionLabel
            {
                get
                {
                    fixed (byte* ptr = descLabel)
                    {
                        return PtrToStringUTF8(new IntPtr(ptr));
                    }
                }
            }
        };
        
        public static DlcWeaponData RETURN_WEAPON_DATA_SP(WeaponHash wep)
        {
            int numDlcWeapons = Function.Call<int>(Hash.GET_NUM_DLC_WEAPONS_SP);
            int i = 0;
            DlcWeaponData weaponData = new();
            unsafe
            {
                while (i < numDlcWeapons)
                {
                    if (Function.Call<bool>(Hash.GET_DLC_WEAPON_DATA_SP, i, &weaponData))
                    {
                        if (weaponData.Hash == wep)
                        {
                            return weaponData;
                            break;
                        }
                    }
                    i++;
                }
            }

            return weaponData;
        }
        public static DlcWeaponData RETURN_WEAPON_DATA_MP(WeaponHash wep)
        {
            int numDlcWeapons = Function.Call<int>(Hash.GET_NUM_DLC_WEAPONS);
            int i = 0;
            DlcWeaponData weaponData = new();
            unsafe
            {
                while (i < numDlcWeapons)
                {
                    if (Function.Call<bool>(Hash.GET_DLC_WEAPON_DATA, i, &weaponData))
                    {
                        if (weaponData.Hash == wep)
                        {
                            return weaponData;
                            break;
                        }
                    }
                    i++;
                }
            }

            return weaponData;
        }
        
        [StructLayout(LayoutKind.Explicit, Size = 0x110)]
        internal unsafe struct DlcWeaponComponentData
        {
            [FieldOffset(0x00)] int attachBone; // The bone on the gun to attach the component to
            [FieldOffset(0x08)] int bActiveByDefault;
            [FieldOffset(0x18)] int componentHash;
            [FieldOffset(0x28)] int componentCost;
            [FieldOffset(0x30)] fixed byte name[0x40];
            [FieldOffset(0x70)] fixed byte desc[0x40];

            public WeaponComponentHash Hash => (WeaponComponentHash)componentHash;

            public WeaponAttachmentPoint AttachmentPoint => (WeaponAttachmentPoint)attachBone;

            public string DisplayName
            {
                get
                {
                    fixed (byte* ptr = name)
                    {
                        return PtrToStringUTF8(new IntPtr(ptr));
                    }
                }
            }

            public string DescriptionLabel
            {
                get
                {
                    fixed (byte* ptr = desc)
                    {
                        return PtrToStringUTF8(new IntPtr(ptr));
                    }
                }
            }
        }

        public static DlcWeaponComponentData RETURN_WEAPON_DATA_MP(WeaponHash wep, WeaponComponentHash wepcomp)
        {
            int numDlcWeapons = Function.Call<int>(Hash.GET_NUM_DLC_WEAPONS);
